English/NCE2/L68 Persistent.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-06 Tue 22:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org8400af0" class="outline-2">
<h2 id="org8400af0">Lesson 68 Persistent</h2>
<div class="outline-text-2" id="text-org8400af0">
<p class="verse">
Why did Elizabeth tell Nigel that she was going to the dentist?<br />
<br />
I crossed the street to <b>avoid meeting</b> him, but he saw me and came running towards me.<br />
<b>It was no use pretending that</b> I had not seen him, so I waved to him.<br />
I never <b>enjoy meeting</b> Nigel Dykes.<br />
He never has anything to do.<br />
<b>No matter how</b> busy you are,	he always <b>insists on coming</b> with you.<br />
I had to think of a way of <b>preventing him from following me around</b> all morning.<br />
<br />
'Hello, Nigel,' I said.<br />
'<b>Fancy meeting you here</b>!'<br />
<br />
'Hi, Elizabeth,' Nigel answered.<br />
'<b>I was just wondering</b> how to spend the morning &#x2013; until I saw you.'<br />
'You're not busy doing anything, are you?'<br />
<br />
No, not at all, I answered.<br />
'I'm going to&#x2026;'<br />
<br />
'<b>Would you mind my coming</b> with you?' he asked, before I had <b>finished speaking</b>.<br />
<br />
'Not at all,' I lied, 'but I'm going to the dentist.'<br />
<br />
'Then I'll come with you,' he answered.<br />
'There's always plenty to read in the waiting room!'<br />
</p>
</div>
<div id="outline-container-org1f156fc" class="outline-3">
<h3 id="org1f156fc">expression</h3>
<div class="outline-text-3" id="text-org1f156fc">
<p>
persistent [pərˈsɪstənt] adj.坚持的,固执的<br />
avoid [əˈvɔɪd] v.避开<br />
insist [ɪnˈsɪst] v.坚持做<br />
cross [krɔs] v. across [əˈkrɔs] prep. 穿过<br />
</p>

<p>
avoid doing sth. 避免做某事<br />
insist on doing sth. 坚持做某事<br />
It is no use pretending that + sentence 假装&#x2026;是没有用的<br />
prevent sb. from doing sth. 阻止某人做某事;<br />
Fancy meeting you here. 没想到在这遇见你<br />
</p>
<hr />
<p>
no matter how/what/where/whose/who/which/when ?<br />
even though(although/though/as) VS even if<br />
</p>

<p>
enjoy doing sth. 享受做某事<br />
no matter how/what/where 无论如何/什么/在哪里<br />
follow sb. around 围绕某人转/走<br />
I was wondering.. + sentence 我在想&#x2026;<br />
would you mind my doing&#x2026; 你介意我做……吗?<br />
finish doing sth. 完成做某事<br />
</p>
</div>
</div>



<div id="outline-container-org4a432c0" class="outline-3">
<h3 id="org4a432c0">单词造句</h3>
<div class="outline-text-3" id="text-org4a432c0">
<p>
persistent adj.<br />
</p>
<ul class="org-ul">
<li>She is a persistent girl.<br /></li>
<li>A persistent girl insists on going to the concert.<br /></li>
<li>I want to avoid meeting the persistent girl.<br /></li>
<li>What a persistent girl.<br /></li>
<li>The persistent girl has made a big decision on the last day.<br /></li>
</ul>
<p>
avoid v. avoid doing sth.<br />
</p>
<ul class="org-ul">
<li>The waiter avoided teaching me any words.<br /></li>
<li>The search party avoids holding up the traffic.<br /></li>
<li>If you bought it yesterday, we would avoid being hungry now.<br /></li>
<li>If you had bought it yesterday, we would have avoided being hungry.<br /></li>
<li>You should have avoided smoking in the theater.<br /></li>
</ul>
<p>
insist v. insist on doing sth.<br />
</p>
<ul class="org-ul">
<li>He insists on naming the lake Kituro.<br /></li>
<li>He insisted on making a speech, even though he noticed that he had made so many mistakes.<br /></li>
<li>He insisted on removing the tyre from the new car.<br /></li>
<li>He insisted on pointing out my mistakes, even though I was crying.<br /></li>
<li>He insisted on telling lies when Rachel had already known it.<br /></li>
</ul>
<p>
cross v. across prep.<br />
</p>
<ul class="org-ul">
<li>I crossed the street to avoid meeting him.<br /></li>
<li>I crossed the street to seek out the thief.<br /></li>
<li>After you have arrived, she crosses the field to go for a walk.<br /></li>
<li>She used to live across the street.<br /></li>
<li>She has regretted moving to the house.<br /></li>
</ul>
<p>
It is no use pretending that + sentence<br />
</p>
<ul class="org-ul">
<li>It is no use pretending that you work hard.<br /></li>
<li>It is no use pretending that you win every time.<br /></li>
<li>It is no use pretending that there is a party on the other side of the river.<br /></li>
<li>It is no use pretending that you don't fall in love with me.<br /></li>
<li>It is no use pretending that you haven't had breakfast.<br /></li>
</ul>
<p>
prevent sb. from doing sth.<br />
</p>
<ul class="org-ul">
<li>I am always preventing my wife from buying new clothes.<br /></li>
<li>I always prevent my wife from buying new clothes.<br /></li>
<li>I succeeded in preventing my wife from running into serious trouble.<br /></li>
<li>Rachel has prevented Ross from catching the flight.<br /></li>
<li>He is always preventing his friends from shaking his hands.<br /></li>
</ul>
<p>
Fancy meeting you here.<br />
</p>
<ul class="org-ul">
<li>Hey. Fancy meeting you here.<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org023a217" class="outline-3">
<h3 id="org023a217">反复听电影片段</h3>
</div>
<div id="outline-container-orgae1c8a0" class="outline-3">
<h3 id="orgae1c8a0">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-org7da1e62" class="outline-3">
<h3 id="org7da1e62">给自己讲解</h3>
</div>
<div id="outline-container-org3e61c3c" class="outline-3">
<h3 id="org3e61c3c">红皮书</h3>
</div>
<div id="outline-container-org45fea78" class="outline-3">
<h3 id="org45fea78">习惯用法造句</h3>
<div class="outline-text-3" id="text-org45fea78">
<p>
enjoy doing sth.<br />
</p>
<ul class="org-ul">
<li>I enjoy watching the movie very much.<br /></li>
<li>I enjoyed getting up early today.<br /></li>
<li>Just then, the little girl enjoyed taking an elevator.<br /></li>
<li>Do you enjoy having breakfast?<br /></li>
<li>He enjoys his own telephone service very much.<br /></li>
</ul>
<p>
no matter how/what/where<br />
</p>
<ul class="org-ul">
<li>No matter how angry his son was, he insisted on drinking a lot every day.<br /></li>
<li>No matter what she has done, she still loves you.<br /></li>
<li>No matter where the theater is, she avoids going to it.<br /></li>
<li>No matter how beautiful the village is, he insists on preventing his wife from going to it.<br /></li>
<li>No matter whose umbrella it is, I sent it to my child.<br /></li>
</ul>
<p>
follow sb. around<br />
</p>
<ul class="org-ul">
<li>Stop following me around.<br /></li>
<li>You are following me around the whole day.<br /></li>
<li>He prevents himself from following his boss around.<br /></li>
<li>After following the girl around all morning, he received a cold welcome.<br /></li>
<li>I was wondering if you have been following me around all evening.<br /></li>
</ul>
<p>
I was wondering.. + sentence<br />
</p>
<ul class="org-ul">
<li>I was wondering: what's wrong with you?<br /></li>
<li>I was wondering: It's none of your business.<br /></li>
<li>I was wondering: how to become a fluent speaker.<br /></li>
<li>I was wondering if the Greenwood boys will give five performances.<br /></li>
<li>I was wondering which songs I should listen to.<br /></li>
</ul>
<p>
would you mind my doing&#x2026;<br />
</p>
<ul class="org-ul">
<li>Do you mind my opening the window?<br /></li>
<li>Would you mind my smoking here?<br /></li>
<li>Would you mind my getting the remote control?<br /></li>
<li>Would you mind his talking loudly?<br /></li>
<li>Would you mind his leaving a message?<br /></li>
</ul>
<p>
finish doing sth.<br />
</p>
<ul class="org-ul">
<li>I have already finished doing my homework.<br /></li>
<li>I finished studying the textbook, New Concept English.<br /></li>
<li>She has finished cooking dinner.<br /></li>
<li>Mr. Leo finishes explaining the reason to everyone.<br /></li>
<li>He finishes breaking the record.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org44ff05e" class="outline-3">
<h3 id="org44ff05e">跟读至背诵</h3>
</div>
<div id="outline-container-org15217f6" class="outline-3">
<h3 id="org15217f6">Ask me if 写+读</h3>
<div class="outline-text-3" id="text-org15217f6">
<ol class="org-ol">
<li>I saw Nigel Dykes coming towards me.(Who)<br />
Who did you see coming towards you?<br /></li>
<li>I crossed the street.(When)<br />
When did you cross the street?<br /></li>
<li>I crossed the street to avoid meeting him.(What&#x2026;do)(Why)<br />
What did you do?<br />
Why did you cross the street to avoid meeting him?<br /></li>
<li>He saw me.(Who)<br />
Who saw you?<br /></li>
<li>He came running towards me.(Who)<br />
Who came running towards you?<br /></li>
<li>I waved to him.(Who&#x2026;to)<br />
Who did you wave to?<br /></li>
<li>I don't enjoy meeting Nigel.(Why)<br />
Why don't you enjoy meeting Nigel?<br /></li>
<li>He always follows people around.(Who)<br />
Who always follows people around?<br /></li>
<li>I said, Hello, Nigel.(What)<br />
What did you say?<br /></li>
<li>I said I was going to the dentist.(What)(Where)<br />
What did you say?<br />
Where did you say you were going?<br /></li>
<li>There's always plenty to read in the waiting room.(What)(Where)<br />
What is there in the waiting room?<br />
Where is there always plenty to read?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgc73bc33" class="outline-3">
<h3 id="orgc73bc33">摘要写作</h3>
<div class="outline-text-3" id="text-orgc73bc33">
<p>
Even though Elizabeth tried to avoid meeting Nigel Dykes, she wasn't able to do so.<br />
As he always insisted on accompanying her,<br />
	she had to think of a way of preventing him from following her around all morning.<br />
When she told him she was going to the dentist,<br />
	he said he would come with her because there's always plenty to read in the waiting room.<br />
</p>
</div>
</div>

<div id="outline-container-orged9f70e" class="outline-3">
<h3 id="orged9f70e"><span class="done DONE">DONE</span> tell the story 口语</h3>
<div class="outline-text-3" id="text-orged9f70e">
</div>
</div>
<div id="outline-container-org4953562" class="outline-3">
<h3 id="org4953562">Topics for discussion</h3>
<div class="outline-text-3" id="text-org4953562">
<p>
What sort of people do you try to avoid? Why?<br />
	I try to avoid some people who get angry easily.<br />
	If someone is mad at me, I can't bear it.<br />
What method would you use to try to avoid<br />
	(a) meeting someone you didn't like<br />
	or (b) doing something you didn't want to do?<br />
	a. Because I always prevent myself from doing something I don't want to do.<br />
</p>

<p>
If you didn't have to work for a living, would you work anyway? Why/ Why not?<br />
	No, I didn't.<br />
	If I didn't have to work for a living, I would spend time studying.<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
